NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_readback_util.c
/*
 * This confidential and proprietary software may be used only as
 * authorised by a licensing agreement from ARM Limited
 * (C) COPYRIGHT 2009-2012 ARM Limited
 * ALL RIGHTS RESERVED
 * The entire notice above must be reproduced on all authorised
 * copies and copies may only be made to the extent permitted
 * by a licensing agreement from ARM Limited.
 */

#include <mali_system.h>
#include <regs/MALIGP2/mali_gp_core.h>
#include <regs/MALI200/mali_rsw.h>
#include "m200_readback_util.h"
#include "m200_gp_frame_builder_struct.h"
#include "m200_gp_frame_builder_inlines.h"
#include "m200_quad.h"



/**
 * Sets up a texture descriptor that uses the content of src_render_target's pixel buffer/surface as a texture
 */
MALI_STATIC void setup_readback_td( m200_td      *readback_td,
                                    mali_surface *src_render_target,
                                    mali_bool     texel_order_invert,
                                    mali_bool     red_blue_swap );

/**
 * Initialize an RSW that perform of a framebuffer readback onto a quad with default values
 *
 * @note This function does _not_ add a texture descriptor that reference the actual memory area
 *       to be read back to the RSW. This has to be done after this function has run in order to
 *       use the RSW for readbacks.
 * @see add_texture_descriptors_to_rsw
 *
 * @param readback_rsw                    A pointer to the rsw to initialize
 * @param target_type                     The type (color, depth, stencil) of the attachment/render_target_set to read back
 * @param readback_shader_address         The address of the shader in mali memory
 * @param first_shader_instruction_length The length of the first shader instruction
 * @param varying_block_address           The address of the varying_block in mali memory
 */

MALI_STATIC void _mali_readback_init_readback_rsw( m200_rsw                    *readback_rsw,
                                                   u32                          usage,
                                                   m200_texel_format            texel_format,
                                                   mali_addr                    readback_shader_address,
                                                   u32                          first_shader_instruction_length,
                                                   mali_addr                    varying_block_address )
{
	_mali_sys_memset( readback_rsw, 0x0, sizeof( m200_rsw ) );

	/* Shader parameters */
	__m200_rsw_encode( readback_rsw, M200_RSW_HINT_NO_SHADER_PRESENT,          0 );
	__m200_rsw_encode( readback_rsw, M200_RSW_FIRST_SHADER_INSTRUCTION_LENGTH, first_shader_instruction_length );
	__m200_rsw_encode( readback_rsw, M200_RSW_SHADER_ADDRESS,                  readback_shader_address);


	/* z near & far */
	__m200_rsw_encode( readback_rsw, M200_RSW_Z_NEAR_BOUND, 0x0);
	__m200_rsw_encode( readback_rsw, M200_RSW_Z_FAR_BOUND,  0xffff);

	/* Write to all subsamples */
	__m200_rsw_encode( readback_rsw, M200_RSW_MULTISAMPLE_WRITE_MASK,  0xf);

	/* 1 varying, 2-component fp32 */
	__m200_rsw_encode( readback_rsw, M200_RSW_PER_VERTEX_VARYING_BLOCK_SIZE, 1 );
	__m200_rsw_encode( readback_rsw, M200_RSW_VARYING0_FORMAT,               M200_VARYING_FORMAT_FP32_2C );

	/* No uniforms */
	__m200_rsw_encode( readback_rsw, M200_RSW_UNIFORMS_REMAPPING_TABLE_SIZE,              0 );
	__m200_rsw_encode( readback_rsw, M200_RSW_HINT_FETCH_SHADER_UNIFORMS_REMAPPING_TABLE, 0 );


	/* Init some of the texture descriptor values. Note that the M200_RSW_TEX_DESCRIPTOR_REMAPPING_TABLE_SIZE
	 * and M200_RSW_TEX_DESCRIPTOR_REMAPPING_TABLE_ADDRESS parts are _not_ set by this function and has to be
	 * added before RSW is used for readbacks  */
	__m200_rsw_encode( readback_rsw, M200_RSW_TEX_DESCRIPTOR_REMAPPING_TABLE_LOG2_SIZE,  0 );
	__m200_rsw_encode( readback_rsw, M200_RSW_HINT_FETCH_TEX_DESCRIPTOR_REMAPPING_TABLE, 1);


	/* No alpha masking */
	__m200_rsw_encode( readback_rsw, M200_RSW_ALPHA_TEST_FUNC, M200_TEST_ALWAYS_SUCCEED );

	/* Blending disabled == Source*1 + Destination*0 */
	/* rgb */
	__m200_rsw_encode( readback_rsw, M200_RSW_RGB_BLEND_FUNC,            M200_BLEND_CsS_pCdD );
	__m200_rsw_encode( readback_rsw, M200_RSW_RGB_S_SOURCE_SELECT,       M200_SOURCE_0 );
	__m200_rsw_encode( readback_rsw, M200_RSW_RGB_S_SOURCE_1_M_X,        1);
	__m200_rsw_encode( readback_rsw, M200_RSW_RGB_S_SOURCE_ALPHA_EXPAND, 0);
	__m200_rsw_encode( readback_rsw, M200_RSW_RGB_D_SOURCE_SELECT,       M200_SOURCE_0 );
	__m200_rsw_encode( readback_rsw, M200_RSW_RGB_D_SOURCE_1_M_X,        0);
	__m200_rsw_encode( readback_rsw, M200_RSW_RGB_D_SOURCE_ALPHA_EXPAND, 0);

	/* alpha */
	__m200_rsw_encode( readback_rsw, M200_RSW_ALPHA_BLEND_FUNC,          M200_BLEND_CsS_pCdD );
	__m200_rsw_encode( readback_rsw, M200_RSW_ALPHA_S_SOURCE_SELECT,     M200_SOURCE_0 );
	__m200_rsw_encode( readback_rsw, M200_RSW_ALPHA_S_SOURCE_1_M_X,      1);
	__m200_rsw_encode( readback_rsw, M200_RSW_ALPHA_D_SOURCE_SELECT,     M200_SOURCE_0 );
	__m200_rsw_encode( readback_rsw, M200_RSW_ALPHA_D_SOURCE_1_M_X,      0);

	/* Color mask */
	if( MALI_OUTPUT_COLOR & usage )
	{
		__m200_rsw_encode( readback_rsw, M200_RSW_R_WRITE_MASK, 1 );
		__m200_rsw_encode( readback_rsw, M200_RSW_G_WRITE_MASK, 1 );
		__m200_rsw_encode( readback_rsw, M200_RSW_B_WRITE_MASK, 1 );
		__m200_rsw_encode( readback_rsw, M200_RSW_A_WRITE_MASK, 1 );
	}
	else __m200_rsw_encode( readback_rsw, M200_RSW_ABGR_WRITE_MASK, 0x0 );

	/* Depth test settings */
	__m200_rsw_encode( readback_rsw, M200_RSW_Z_COMPARE_FUNC, M200_TEST_ALWAYS_SUCCEED );
	if ( MALI_OUTPUT_DEPTH & usage )
	{
		if(texel_format == M200_TEXEL_FORMAT_DEPTH_STENCIL_24_8)
		{
			/* verbatim copy (used by S24Z8) also need a matching write. */
			__m200_rsw_encode( readback_rsw, M200_RSW_DST_ENABLE,              0x1); 
		}
		__m200_rsw_encode( readback_rsw, M200_RSW_SHADER_Z_REPLACE_ENABLE, 0x1);
		__m200_rsw_encode( readback_rsw, M200_RSW_Z_WRITE_MASK,            0x1);
	}
	else __m200_rsw_encode( readback_rsw, M200_RSW_Z_WRITE_MASK, 0x0);

	/* Stencil test settings. Always pass. */
	__m200_rsw_encode( readback_rsw, M200_RSW_STENCIL_FRONT_COMPARE_FUNC, M200_TEST_ALWAYS_SUCCEED );
	__m200_rsw_encode( readback_rsw, M200_RSW_STENCIL_BACK_COMPARE_FUNC,  M200_TEST_ALWAYS_SUCCEED );

	if ( MALI_OUTPUT_STENCIL & usage )
	{
		__m200_rsw_encode( readback_rsw, M200_RSW_DST_ENABLE,                    0x1);
		__m200_rsw_encode( readback_rsw, M200_RSW_SHADER_STENCIL_REPLACE_ENABLE, 0x1);
		__m200_rsw_encode( readback_rsw, M200_RSW_STENCIL_FRONT_WRITE_MASK,      0xff );
		__m200_rsw_encode( readback_rsw, M200_RSW_STENCIL_BACK_WRITE_MASK,       0xff );

