NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_readback_util.c
		__m200_rsw_encode( readback_rsw, M200_RSW_STENCIL_FRONT_OP_IF_ZPASS,  M200_STENCIL_OP_SET_TO_REFERENCE );
		__m200_rsw_encode( readback_rsw, M200_RSW_STENCIL_FRONT_OP_IF_ZFAIL,  M200_STENCIL_OP_SET_TO_REFERENCE );
		__m200_rsw_encode( readback_rsw, M200_RSW_STENCIL_FRONT_OP_IF_SFAIL,  M200_STENCIL_OP_SET_TO_REFERENCE );
		__m200_rsw_encode( readback_rsw, M200_RSW_STENCIL_BACK_OP_IF_ZPASS,   M200_STENCIL_OP_SET_TO_REFERENCE );
		__m200_rsw_encode( readback_rsw, M200_RSW_STENCIL_BACK_OP_IF_ZFAIL,   M200_STENCIL_OP_SET_TO_REFERENCE );
		__m200_rsw_encode( readback_rsw, M200_RSW_STENCIL_BACK_OP_IF_SFAIL,   M200_STENCIL_OP_SET_TO_REFERENCE );
	}
	else
	{
		/* Leave the stencil buffer as-is */
		__m200_rsw_encode( readback_rsw, M200_RSW_STENCIL_FRONT_OP_IF_ZPASS,  M200_STENCIL_OP_KEEP_CURRENT );
		__m200_rsw_encode( readback_rsw, M200_RSW_STENCIL_FRONT_OP_IF_ZFAIL,  M200_STENCIL_OP_KEEP_CURRENT );
		__m200_rsw_encode( readback_rsw, M200_RSW_STENCIL_FRONT_OP_IF_SFAIL,  M200_STENCIL_OP_KEEP_CURRENT );
		__m200_rsw_encode( readback_rsw, M200_RSW_STENCIL_BACK_OP_IF_ZPASS,   M200_STENCIL_OP_KEEP_CURRENT );
		__m200_rsw_encode( readback_rsw, M200_RSW_STENCIL_BACK_OP_IF_ZFAIL,   M200_STENCIL_OP_KEEP_CURRENT );
		__m200_rsw_encode( readback_rsw, M200_RSW_STENCIL_BACK_OP_IF_SFAIL,   M200_STENCIL_OP_KEEP_CURRENT );
	}

	/* set the varying base address (1 FP32 vec2 per vertex) */
	__m200_rsw_encode( readback_rsw, M200_RSW_VARYING0_FORMAT,               M200_VARYING_FORMAT_FP32_2C  );
	__m200_rsw_encode( readback_rsw, M200_RSW_VARYINGS_BASE_ADDRESS,         varying_block_address );
	__m200_rsw_encode( readback_rsw, M200_RSW_PER_VERTEX_VARYING_BLOCK_SIZE, (8/8) ); /* 8 bytes (2C FP32); given in 8 byte units */
}

/**
 * Creates one (or two) texture descriptor(s) that reference the contents of the given src_render_target.
 * @note It is the callers responsibility to delete the texture descriptor(s).
 *
 * @param pool        The frame pool on where to allocate memory. 
 * @param src_target  The surface to create a readback texture descriptor for
 * @param num_td      An output parameters that will be set to the number of texture descriptors that were
 *                    created by this function
 * @param [OUT] out_td_remap_table_addr The mali adress for the TD remap table. Output parameter.
 */
MALI_STATIC mali_err_code _mali_readback_create_readback_texture_descriptors( mali_mem_pool*           pool,
                                                                              mali_surface            *src_target,
																			  u32                      usage,
                                                                              u32                     *num_td,
																			  u32*                     td_remap_local_addr)
{
	u32              td_mem_size;
	u32             *td_local_ptr, *td_remap_local_ptr;
	u32              td_mali_addr;
	u32              num_td_local;

	MALI_IGNORE( usage );
	
#if HARDWARE_ISSUE_4849
	if ( (usage & MALI_OUTPUT_DEPTH) && M200_TEXEL_FORMAT_DEPTH_STENCIL_24_8 == src_target->format.texel_format )
	{
		/* Need memory for 2 texture descriptor and a 2-entry remapping table, 64 byte alignment and readable by Mali200 */
		num_td_local = 2;
	}
	else
#endif
	{
		/* Only need memory for 1 texture descriptor and a 1-entry remapping table, 64 byte alignment and readable by Mali200 */
		num_td_local = 1;
	}

	td_mem_size = ( num_td_local * sizeof(m200_td) ) + ( num_td_local * sizeof(u32*) );
	td_local_ptr = _mali_mem_pool_alloc(pool, td_mem_size, &td_mali_addr);
	if(td_local_ptr == NULL) return MALI_ERR_OUT_OF_MEMORY;

	_mali_sys_memset(td_local_ptr, 0, td_mem_size); /* zeroing the TD memory; this cause all pointers to be NULL by default unless otherwise set */

	/* Point to the first TD remap entry */
	td_remap_local_ptr = (u32 *) ( (u32)td_local_ptr + num_td_local * sizeof( m200_td ) );
	*td_remap_local_addr = td_mali_addr + (num_td_local * sizeof( m200_td ));

	/* Set up TD using the render attachment as texture source */
	setup_readback_td( (m200_td *) td_local_ptr, src_target,
	                   src_target->format.reverse_order, src_target->format.red_blue_swap );

	/* Set the address of the TD in the remap table */
	td_remap_local_ptr[0] = td_mali_addr;

#if HARDWARE_ISSUE_4849
	if ( (usage & MALI_OUTPUT_DEPTH) && M200_TEXEL_FORMAT_DEPTH_STENCIL_24_8 == src_target->format.texel_format )
	{
		u32 *td_local_depth_ptr;

		/* Set up the second texture descriptor required for depth attachements */
		MALI_DEBUG_ASSERT( 2 == num_td_local, ("Must have 2 TDs for VERBATIM32 depth attachments") );
		td_local_depth_ptr = (u32 *) ( (u32)td_local_ptr + sizeof( m200_td ) );
		setup_readback_td( (m200_td *) td_local_depth_ptr, src_target, MALI_TRUE, MALI_FALSE );
		td_remap_local_ptr[1] = td_mali_addr + sizeof( m200_td );
	}
#endif

	(*num_td) = num_td_local;
	return MALI_ERR_NO_ERROR;
}

/**
 * Adds the texture descriptor table located at td_address to the RSW. num_td contains how many texture descriptor
 * there are in the table.
 *
 * @param readback_rsw The rsw to add the texture descriptor table to
 * @param td_address   The address in mali memory to the texture descriptor table to
 * @param num_td       The number of texture descriptor in the texture descriptor table
 * @param write_mask   The multisample write mask to encode into the RSW
 */

MALI_STATIC void _mali_readback_add_texture_descriptors_to_rsw( m200_rsw  *readback_rsw,
                                                                mali_addr  td_address,
                                                                u32        num_td,
                                                                u32        write_mask )
{
	/* Setup RSW for 1 remapping table entry */
	__m200_rsw_encode( readback_rsw, M200_RSW_TEX_DESCRIPTOR_REMAPPING_TABLE_SIZE,    num_td );
	__m200_rsw_encode( readback_rsw, M200_RSW_TEX_DESCRIPTOR_REMAPPING_TABLE_ADDRESS, td_address );

	/* Subsamples to write to */
	__m200_rsw_encode( readback_rsw, M200_RSW_MULTISAMPLE_WRITE_MASK, write_mask);
}


