NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_readback_util.c
MALI_STATIC void setup_readback_td( m200_td      *readback_td,
                                    mali_surface *src_render_target,
                                    mali_bool     texel_order_invert,
                                    mali_bool     red_blue_swap )
{
	m200_texel_format texel_format;

	MALI_DEBUG_ASSERT_POINTER( src_render_target );
	MALI_DEBUG_ASSERT_POINTER( readback_td );

	/* initializing the texture descriptor with the default values */
	m200_texture_descriptor_set_defaults( *readback_td );

	/* setting up the texture descriptor parameters that differ from the default */
	MALI_TD_SET_TEXTURE_FORMAT( *readback_td, M200_TEXTURE_FORMAT_NON_NORMALIZED ); 
	MALI_TD_SET_POINT_SAMPLE_MINIFY( *readback_td, 1 );
	MALI_TD_SET_POINT_SAMPLE_MAGNIFY( *readback_td, 1 );
	MALI_TD_SET_TEXEL_ORDER_INVERT( *readback_td, ( MALI_TRUE == texel_order_invert) ? 1 : 0 );
	MALI_TD_SET_TEXEL_RED_BLUE_SWAP( *readback_td, ( MALI_TRUE == red_blue_swap) ? 1 : 0 );

	texel_format =  src_render_target->format.texel_format;

	/* in the case of readback the correct mapping of S8Z24 surfaces is to read them in using the verbatim copy format */
	if( texel_format == M200_TEXEL_FORMAT_DEPTH_STENCIL_24_8) texel_format = M200_TEXEL_FORMAT_VERBATIM_COPY32;

	MALI_DEBUG_ASSERT(M200_TEXEL_FORMAT_NO_TEXTURE != texel_format, ("Readback texture does not carry a texel format. It cannot be read from using Mali."));

	MALI_TD_SET_TEXEL_FORMAT( *readback_td, texel_format );
	if ( MALI_PIXEL_LAYOUT_LINEAR == src_render_target->format.pixel_layout )
	{
		MALI_TD_SET_TEXTURE_DIMENSION_S( *readback_td, src_render_target->format.pitch / (u32) __m200_texel_format_get_size(texel_format) );
	}
	else
	{
		MALI_TD_SET_TEXTURE_DIMENSION_S( *readback_td, src_render_target->format.width );
	}
	MALI_TD_SET_TEXTURE_DIMENSION_T( *readback_td, src_render_target->format.height );

	switch( src_render_target->format.pixel_layout )
	{
		case MALI_PIXEL_LAYOUT_INTERLEAVED_BLOCKS:
			MALI_TD_SET_TEXTURE_ADDRESSING_MODE( *readback_td, M200_TEXTURE_ADDRESSING_MODE_16X16_BLOCKED );
		break;
		case MALI_PIXEL_LAYOUT_LINEAR:
			MALI_TD_SET_TEXTURE_ADDRESSING_MODE( *readback_td, M200_TEXTURE_ADDRESSING_MODE_LINEAR );
		break;
		default:
			MALI_DEBUG_ASSERT( 0, ("incorrect layout: %d\n", src_render_target->format.pixel_layout ));
			MALI_TD_SET_TEXTURE_ADDRESSING_MODE( *readback_td, M200_TEXTURE_ADDRESSING_MODE_LINEAR );
	}

#define FROM_ADDR( x ) ( x >> 6 )
	MALI_TD_SET_MIPMAP_ADDRESS_0( *readback_td, FROM_ADDR( _mali_mem_mali_addr_get( src_render_target->mem_ref->mali_memory, src_render_target->mem_offset ) ) );
#undef FROM_ADDR
}

/**
 * Creates a texture descriptor that reference the given rendertarget's pixel data and encodes it in the RSW. This
 * means that a readback of the given rendertarget is added to the RSW.
 */
MALI_STATIC MALI_CHECK_RESULT mali_err_code add_rendertarget_readback_td_to_rsw( 
                                     mali_mem_pool           *pool,
                                     m200_rsw                *readback_rsw,
                                     mali_surface            *src,
                                     u32                      usage,
                                     u32                      write_mask )
{
		mali_err_code err;
		/* The texture descriptor to the texture containing the buffer to read back (and its size) */
		/* The number of texture descriptor needed for the readback. Will be 1 unless HARDWARE_ISSUE_
		 * 4849 is defined in which case it will be 2 */
		u32 num_td = 0;
		u32 td_remap_addr = 0;

		/* Create the texture descriptor(s) that are needed to perform a readback of the render target */
		err = _mali_readback_create_readback_texture_descriptors( pool, src, usage, &num_td, &td_remap_addr );
		if(err != MALI_ERR_NO_ERROR) return err;

		/* Add the readback texture descriptor to the RSW */
		_mali_readback_add_texture_descriptors_to_rsw( readback_rsw,
		                                               td_remap_addr,
		                                               num_td,
		                                               write_mask );
 
		return MALI_ERR_NO_ERROR;
}

/**
 * Initializes the texture coordinates for the quad. 
 * Texture coordinates are always mapping the entire texture. 
 *
 * @param varying_mem    A mali mem handle to the memory block in mali memory to initialize with texture the quad coordinates
 * @param x1             The x coordinate of the first corner of the quad
 * @param y1             The y coordinate of the first corner of the quad
 * @param x2             The x coordinate of the second corner of the quad
 * @param y2             The y coordinate of the second corner of the quad
 */
MALI_STATIC MALI_CHECK_RESULT mali_err_code alloc_pos_and_texcoords( mali_mem_pool* pool,
                                                                     float offset_x,
                                                                     float offset_y,
                                                                     float width,
                                                                     float height,
                                                                     mali_surface* surface,
											                         mali_addr *out_position_mem_addr,
											                         mali_addr *out_varying_mem_addr)
{
	float* varying_mem;
	float* position;


	varying_mem = _mali_mem_pool_alloc(pool, 3*2*sizeof(float), out_varying_mem_addr);
	if(varying_mem == NULL) return MALI_ERR_OUT_OF_MEMORY;

	varying_mem[0] = surface->format.width;
	varying_mem[1] = 0.0;

	varying_mem[2] = 0.0;
	varying_mem[3] = 0.0;

	varying_mem[4] = 0.0;
	varying_mem[5] = surface->format.height;

	position = _mali_mem_pool_alloc(pool, (3 * 4 * sizeof(float)), out_position_mem_addr);
	if( NULL == position) return MALI_ERR_OUT_OF_MEMORY;
		
	/* set quad position and texcoord data - flipped across the first and last vertex */
	position[0] = width+offset_x;
	position[1] = offset_y;
	position[2] = 0.0;
	position[3] = 1.0;

	position[4] = offset_x;
	position[5] = offset_y;
	position[6] = 0.0;
	position[7] = 1.0;

	position[8] = offset_x;
	position[9] = height+offset_y;
	position[10] = 0.0;
	position[11] = 1.0;

	return MALI_ERR_NO_ERROR;
}


/**
 * Allocate a shader binary on the frame pool. The shader is then set up to match the 
 * required readback. The shader binary will do a color, depth or stencil readback based on the usage parameter. 
 * If HW bugzilla 4849 is present, depth readbacks may require two cycles. 
 */
MALI_STATIC MALI_CHECK_RESULT mali_err_code alloc_fshader_on_pool( mali_mem_pool*       pool,
                                                                   mali_surface*        src, 
                                                                   u32                  usage,
                                                                   mali_addr           *out_shader_addr,
																   u32                 *out_size_of_first_instruction)
{
	/* The shader that will perform the readback, ie. texture the readback quad with the buffer
	 * texture (and its size). The type of shader to use depend on whether HW bugzilla 4849 is present */
	u8  const *readback_shader;
	u32        readback_shader_size;
	void*      pool_mapped_shader_mem;
	mali_addr  pool_mapped_shader_mali_addr;

