NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_readback_util.c
	/*
	 * Shader used to readback stencil and color:
	 * VAR r1, var2[0]       # read texture coord
	 * TEX #var, sampler[0]  # texture look-up
	 * MOV r0, #tex          # texture to output
	 */
	static const u8 texturing_shader[]           = { 0xE6, 0x05, 0x00, 0x00, 0x20, 0x3C, 0x00, 0xF1, 0x00, 0x00, 0x00, 0x00,
	                                                 0x00, 0x10, 0x00, 0x39, 0x4E, 0x0E, 0x00, 0x00, 0xCF, 0x07, 0x00, 0x00 };
	static const u8 z16_shader[]                 = { 0xE6, 0x05, 0x00, 0x00, 0x20, 0x3C, 0x00, 0xF1, 0x00, 0x00, 0x00, 0x00,
	                                                 0x00, 0x10, 0x00, 0x39, 0x4E, 0x0E, 0x00, 0x00, 0xCF, 0x07, 0x00, 0x00 };
	static const u8 texturing_shader_alpha_one[] = { 0xE9, 0x31, 0x02, 0x00, 0x20, 0x3C, 0x00, 0xFF, 0x00, 0x00, 0x00, 0x00,
	                                                 0x00, 0x10, 0x00, 0x39, 0x4E, 0x0A, 0x00, 0x00, 0xC7, 0x17, 0x03, 0x30,
	                                                 0xE4, 0x03, 0x00, 0x00, 0xE0, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };

#if HARDWARE_ISSUE_4849
	/*
	 * Shader used to readback depth:
	 *
	 * precision mediump float;
	 *
	 * varying vec2 coord;
	 * uniform sampler2D Za;
	 * uniform sampler2D Zb;
	 *
	 * void main()
	 * {
	 *		gl_FragColor = vec4(texture2D(Zb, coord).y, texture2D(Za, coord).yyy);
	 * }
	 */
	static const u8 verbatim32_depth_texturing_shader[] =
	{
		0xC6, 0x11, 0x38, 0x02, 0x20, 0x3C, 0x00, 0xFF, 0x00, 0x00, 0x00, 0x00, 0x00, 0x10, 0x00, 0x39,
		0x5E, 0x05, 0x00, 0x00, 0xC4, 0x07, 0x00, 0x00, 0xE7, 0x31, 0x00, 0x00, 0x20, 0x3C, 0x00, 0xFF,
		0x00, 0x00, 0x00, 0x00, 0x01, 0x10, 0x00, 0x39, 0xA0, 0x0A, 0x00, 0x00, 0xCE, 0x97, 0x03, 0x00,
		0xE4, 0x03, 0x00, 0x00 	};
#endif
	
	MALI_IGNORE(usage); /* in case we won't use the parameter */

	/* select which shader to use */
	if(src->format.pixel_format == MALI_PIXEL_FORMAT_Z16)
	{
		readback_shader = z16_shader;
		readback_shader_size = sizeof(z16_shader);
	} else 
#if HARDWARE_ISSUE_4849
	if ( MALI_OUTPUT_DEPTH & usage )
	{
		readback_shader = verbatim32_depth_texturing_shader;
		readback_shader_size = sizeof(verbatim32_depth_texturing_shader);
	} else
#endif
	{
		if(src->format.alpha_to_one)
		{
			readback_shader = texturing_shader_alpha_one;
			readback_shader_size = sizeof(texturing_shader_alpha_one);
		}
		else
		{
			readback_shader = texturing_shader;
			readback_shader_size = sizeof(texturing_shader);
		}
	}

	/* allocate the shader on the frame pool */
	pool_mapped_shader_mem = _mali_mem_pool_alloc(pool, readback_shader_size, &pool_mapped_shader_mali_addr);
	if(pool_mapped_shader_mem == NULL) return MALI_ERR_OUT_OF_MEMORY;

	_mali_sys_memcpy(pool_mapped_shader_mem, readback_shader, readback_shader_size);
	
	*out_shader_addr = pool_mapped_shader_mali_addr;
	*out_size_of_first_instruction = texturing_shader[0] & 0x1F;


	return MALI_ERR_NO_ERROR;
}

/**
 * Allocate a RSW on the frame pool. 
 * The RSW is allocated and set up using the src, usage and varying parameters.
 * The mali_addr of the RSW is returned in the out_rsw_addr parameter. 
 *
 * The varying parameter contains all the per-varying data for the drawcall. 
 * For the drawcall being set up, this data is a 4-component texture coordinate
 * given in non-normalized texture coordinate values. Essentially it equals the 
 * position data.
 */
MALI_STATIC MALI_CHECK_RESULT mali_err_code alloc_rsw_on_pool( mali_mem_pool*       pool,
                                                               mali_surface*        src, 
                                                               u32                  usage,
															   u32                  mrt_writemask,
                                                               mali_addr            varying_addr,
															   mali_addr           *out_rsw_addr)
{
	mali_addr            shader_mem_mali_addr = 0; 
	void*                pool_mapped_rsw_mem;
	u32                  shader_first_instr_length = 0;
	m200_rsw             readback_rsw;
	mali_err_code        err;

	MALI_DEBUG_ASSERT_POINTER(pool);
	MALI_DEBUG_ASSERT_POINTER(src);
	MALI_DEBUG_ASSERT_POINTER(out_rsw_addr);

	/* allocate the fragment shader */
	err = alloc_fshader_on_pool(pool, src, usage, &shader_mem_mali_addr, &shader_first_instr_length);
	if(err != MALI_ERR_NO_ERROR) return err;

	/* Initialize and encode the RSW to use for the readback draw call in local memory */
	_mali_readback_init_readback_rsw( &readback_rsw,
	                                   usage,
	                                   src->format.texel_format,
	                                   shader_mem_mali_addr,
	                                   shader_first_instr_length,
	                                   varying_addr);

	/* set up the TD matching this MRT count */
	err = add_rendertarget_readback_td_to_rsw( pool, &readback_rsw, src, usage, mrt_writemask );
	if(err != MALI_ERR_NO_ERROR) return err;

	/* copy the RSW onto the pool */ 
	pool_mapped_rsw_mem = _mali_mem_pool_alloc(pool, sizeof(m200_rsw), out_rsw_addr);
	if(pool_mapped_rsw_mem == NULL) return MALI_ERR_OUT_OF_MEMORY;

	_mali_sys_memcpy(pool_mapped_rsw_mem, &readback_rsw, sizeof(m200_rsw));

	return MALI_ERR_NO_ERROR;
}


MALI_STATIC MALI_CHECK_RESULT mali_err_code _mali_internal_frame_readback_specific(
												mali_frame_builder    *frame_builder,
												mali_surface *src, u32 usage,
												u16 offset_x,
												u16 offset_y,
												u16 width,
												u16 height )
{
	mali_err_code        err = MALI_ERR_NO_ERROR;
	u32                  mrt_count = 1;

	mali_mem_pool*       pool;

	mali_addr            vertex_mem_mali_addr;
	mali_addr            varying_mem_mali_addr;
	mali_addr            rsw_mem_mali_addr;
	
	MALI_DEBUG_ASSERT_POINTER( frame_builder );
	MALI_DEBUG_ASSERT_POINTER( src );
	pool = _mali_frame_builder_frame_pool_get( frame_builder);

	if ( MALI_OUTPUT_DEPTH & usage )
	{
		/* to ensure the hierarchical Z is set to 0..1 in decision range
		 * we clear the z buffer to 1, and draw the depth quad at z = 0. 
		 * This ensures any z decision is based on depth values written 
		 * by the shaders alone since the hierarchical z buffers
		 * are in the range of 0 to 1. Clearing the Z buffer is only 
		 * legal since we are writing to the depth buffer anyway; and will 
		 * only work if this happens in the beginning of the frame, before 
		 * any depth tests occur. See bugzilla 10547 for reference */
		frame_builder->depth_clear_value = 0xFFFFFFUL; /* 6 * 4 = 24 bit */
	}

