NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_readback_util.c
	/* allocate vertex and varying buffers, fill with data based on offset and dimension parameters */
	err = alloc_pos_and_texcoords( pool, offset_x, offset_y, width, height, src, &vertex_mem_mali_addr, &varying_mem_mali_addr);
	if(err != MALI_ERR_NO_ERROR) return err;

	/* Check if there are several render targets to read in (MRT is enabled) */
	if( usage & MALI_OUTPUT_MRT) mrt_count = 4; /* 4 targets is the only supported count for MRT mode */
	if ( mrt_count == 1 )
	{
		/* allocate the RSW */
		err = alloc_rsw_on_pool(pool, src, usage, 0xf, varying_mem_mali_addr, &rsw_mem_mali_addr);
		if(err != MALI_ERR_NO_ERROR) return err;
		/* Only one MRT so only one quad needs to be drawn */
		err = _mali200_draw_quad( frame_builder,
		                          vertex_mem_mali_addr,
		                          rsw_mem_mali_addr );
		if(err != MALI_ERR_NO_ERROR) return err;
	}
	else
	{
		/* Draw a quad per MRT render target with the readback RSW (rsw_index) and store the vertices in vertex_mem */
		int i;
		for ( i = 0; i < MALI200_WRITEBACK_UNIT_MRT_COUNT; ++i)
		{
			err = alloc_rsw_on_pool(pool, src, usage, 1<<i, varying_mem_mali_addr, &rsw_mem_mali_addr);
			if(err != MALI_ERR_NO_ERROR) return err;
			err = _mali200_draw_quad( frame_builder,
			                          vertex_mem_mali_addr,
			                          rsw_mem_mali_addr );
			if(err != MALI_ERR_NO_ERROR) return err;
		}
	}

	return err;
}

MALI_STATIC MALI_CHECK_RESULT mali_err_code _mali_internal_frame_readback(
												mali_frame_builder     *frame_builder,
												mali_surface *src, u32 usage,
												u16 offset_x,
												u16 offset_y,
												u16 width,
												u16 height )
{
	mali_err_code err;

	/* Current readback implementation support only depth, stencil OR color. So call the 
	 * underlying code up to three times, with only the proper flags set */
	if(usage & MALI_OUTPUT_DEPTH)
	{
		u32 temp_usage = usage;
		temp_usage &= ~(MALI_OUTPUT_STENCIL | MALI_OUTPUT_COLOR);
		err = _mali_internal_frame_readback_specific(frame_builder, src, temp_usage, offset_x, offset_y, width, height );
		if(err != MALI_ERR_NO_ERROR) return err;
	}


	if(usage & MALI_OUTPUT_STENCIL)
	{
		u32 temp_usage = usage;
		temp_usage &= ~(MALI_OUTPUT_COLOR | MALI_OUTPUT_DEPTH);
		err = _mali_internal_frame_readback_specific(frame_builder, src, temp_usage, offset_x, offset_y, width, height );
		if(err != MALI_ERR_NO_ERROR) return err;
	}


	if(usage & MALI_OUTPUT_COLOR)
	{
		u32 temp_usage = usage;
		temp_usage &= ~(MALI_OUTPUT_STENCIL | MALI_OUTPUT_DEPTH);
		err = _mali_internal_frame_readback_specific(frame_builder, src, temp_usage, offset_x, offset_y, width, height );
		if(err != MALI_ERR_NO_ERROR) return err;
	}

	return MALI_ERR_NO_ERROR;

}

MALI_EXPORT MALI_CHECK_RESULT mali_err_code _mali_frame_builder_readback(
														  struct mali_frame_builder     *frame_builder,
														  struct mali_surface *src,
														  u32 usage, 
														  u16 offset_x,
														  u16 offset_y,
														  u16 width,
														  u16 height )
{
	MALI_DEBUG_ASSERT_POINTER( frame_builder );
	
	return _mali_internal_frame_readback( frame_builder, src, usage, offset_x, offset_y, width, height );
}

